README.org
#+TITLE: JSEC - TLS/SSL Library for Janet
#+AUTHOR: llmII <dev@amlegion.org>
#+DATE: 2025-11-29

* Overview

*jsec* (JSEC) is a TLS/SSL library for Janet that aims to be production-quality, built on OpenSSL. It features proper async integration with Janet's event loop (`ev/`), a security-first design, and comprehensive support for both client and server modes.

** API Compatibility Guarantee

The primary design goal of `jsec` is strict compatibility with Janet's standard Stream API.

- **Initialization:** The only intended difference is in connection initialization (e.g., `tls/connect` vs `net/connect`).
- **Behavior:** Once established, a TLS stream should behave *identically* to a standard TCP stream for all methods (`:read`, `:write`, `:close`, `:chunk`, etc.).
- **Extensions:** Where the standard API uses optional arguments (`&opt`), `jsec` may offer extensions. These arguments function as an "either/or" mechanism: they strictly support the standard Janet Stream API conventions but may *also* accept library-specific values (e.g., TLS-specific configuration tables) where appropriate.

**Any deviation in behavior from the standard Janet Stream API (unexpected blocking, method signature mismatches, return value differences) when used in a standard context is considered a bug.** The author has validated this to the best of their ability, but if you encounter any such inconsistency, please report it immediately.

* ⚠️ Security and Auditing Disclaimer

This library implements critical cryptographic protocols. Users must understand the risks associated with this type of software:

- **NO formal security audit has been performed on this codebase.** While the library aims to follow strict engineering and testing standards, we recommend users perform their own risk assessment before deploying in high-value or sensitive production environments. Use at your own risk.
- **Cryptographic Primitives:** The security of the library relies heavily on the underlying C libraries (OpenSSL). While these libraries are industry standards, the binding layer and integration logic have not yet undergone external security review.
- **Vulnerability Reporting:** We highly encourage community review. If you discover a vulnerability, please report it immediately via a fossil ticket or GitHub issue as a public issue. We will address valid reports as promptly as possible. Once the library has been audited in the future this section will be updated with information on how to submit privately so that a fix can be made before the issue is made publicly known, but during this phase of development there is no reason such should not be public by default, and we will strive to keep things as public by default even in the future unless there is a true worry that disclosure might lead to abuse.

* ✅ Robust Testing & Stability Assurance

While a security audit is pending, the library maintains high standards for functional correctness and stability:

- **Comprehensive Test Suite:** The library currently passes over **2,000 automated functional tests** covering handshake procedures, certificate validation, data transfer, error handling, and various edge cases. The high test count is derived from a matrix of test configurations (TLS versions, cipher suites, underlying raw protocol, etc.) run against every functional test case.
- **Performance Benchmarking (Experimental):** A preliminary performance testing framework (perf9) exists for benchmarking throughput, latency, and scalability. *Note: Performance testing is unstable - output formats, metrics, and implementation details are subject to change. Both Janet and C-side optimizations are ongoing.*
  - Protocol comparison (TCP vs TLS vs Unix sockets)
  - TLS version performance comparison
  - Scaling tests across client counts
  - Concurrency mode testing (fibers, threads, subprocesses)
  - Handshake timing analysis
- **Continuous Integration:** Tests are run automatically on every commit via GitHub Actions across Linux environments to ensure ongoing stability. (planned)

** Example Performance Output
Note that perf can be somewhat skewed by testing framework intricacies but it
gives a bit of an idea.

#+begin_details
#+begin_summary
Sample perf9 run: 50 clients, 4 servers, 4 client-hosts, threaded mode, 30s duration
#+end_summary

#+begin_example
================================================================================
  Results by Protocol
================================================================================

  tcp:
    Throughput:    338.07 MB/s (mean), 338.07 MB/s (median), 338.07 MB/s (p95)
    Client range:  1.68 MB/s (slowest) → 1.87 MB/s (fastest)
    Total bytes:   9.90 GB
    Iterations:    81136
    Connected:     200/200
    Participants:  4 server(s), 4 client-host(s)
    Tests:         1

  tls:
    Throughput:    196.54 MB/s (mean), 196.54 MB/s (median), 200.93 MB/s (p95)
    Client range:  980.33 KB/s (slowest) → 1.01 MB/s (fastest)
    Handshake:     346.24 ms (mean), 363.73 ms (p95)
    Total bytes:   11.52 GB
    Iterations:    94339
    Connected:     400/400
    Participants:  4 server(s), 4 client-host(s)
    Tests:         2

================================================================================
  Results by TLS Version
================================================================================

  TLS 1.3:
    Throughput:    196.54 MB/s (mean), 196.54 MB/s (median), 200.93 MB/s (p95)
    Client range:  980.33 KB/s (slowest) → 1.01 MB/s (fastest)
    Handshake:     347.64 ms (mean), 366.18 ms (p95)
    Total bytes:   11.52 GB
    Iterations:    94339
    Connected:     400/400
    Participants:  4 server(s), 4 client-host(s)
    Tests:         2

================================================================================
  Overall Statistics
================================================================================

  All tests:
    Throughput:    243.72 MB/s (mean), 200.93 MB/s (median), 338.07 MB/s (p95)
    Client range:  980.33 KB/s (slowest) → 1.87 MB/s (fastest)
    Handshake:     348.33 ms (mean), 366.47 ms (p95)
    Total bytes:   21.42 GB
    Iterations:    175475
    Connected:     600/600
    Participants:  4 server(s), 4 client-host(s)
    Tests:         3
#+end_example

Run command:
#+begin_src bash
# TCP test
janet test/runner.janet \
  -f 'performance/perf9/echo[protocol=:tcp,client-count=50,duration=30]<parallel=:thread,server=4,client-host=4>' \
  --json /tmp/perf-tcp.json

# TLS 1.3 test
janet test/runner.janet \
  -f 'performance/perf9/echo[protocol=:tls,client-count=50,duration=30,tls-version=1.3]<parallel=:thread,server=4,client-host=4>' \
  --json /tmp/perf-tls.json

# Analyze results
./bin/perf9-analyze -n /tmp/perf-combined.json
#+end_src
#+end_details

