README.md

# Table of Contents

1.  [Overview](#org33d280d)
    1.  [API Compatibility Guarantee](#org7e6e344)
2.  [⚠️ Security and Auditing Disclaimer](#org8c86742)
3.  [✅ Robust Testing & Stability Assurance](#orgb5ac10d)
    1.  [Example Performance Output](#orge45f9e2)
    2.  [Testing Status & Maturity](#org919a7ee)
4.  [⭐ Features and Compatibility](#orgc6cbbe1)
    1.  [Core Features](#orgd4194c9)
    2.  [Supported Backends](#orgc299e2a)
    3.  [Operating System Support](#orgbe2a0fe)
    4.  [Current Limitations](#org9768df8)
5.  [Installation](#org84c26b7)
6.  [Documentation & Examples](#orgb019ee2)
7.  [Quick Start](#orgf7f42fc)
    1.  [Secure Client (TCP/TLS)](#org6825ddf)
    2.  [Secure Server (TCP/TLS)](#orgc974e1e)
    3.  [Self-Signed Certificate Generation](#org23ce23b)
    4.  [STARTTLS Upgrade](#org910d40b)
    5.  [DTLS (Datagram TLS)](#orge8c8bea)
    6.  [BIO (Basic I/O Abstraction)](#orgfb16196)
    7.  [Crypto Primitives](#orga209e87)
8.  [Development & Testing](#org5fd78c7)
    1.  [Building](#org5d9befa)
    2.  [Running Tests](#orgf280252)
    3.  [Memory Leak Checking](#org2a3a736)
    4.  [Debug Build](#orga75b7f7)
    5.  [Code Formatting](#org24278db)
    6.  [Documentation Generation](#org0896b9b)
    7.  [Release Process](#orgc38dc20)
    8.  [Test Coverage Details](#org09bd018)
9.  [Security Configuration](#org737bbd8)
10. [Contributing](#orge7d7a0a)
    1.  [Areas Seeking Help](#orgb2a9ecd)
        1.  [Platform Support](#orgd2e3f79)
        2.  [Testing & Quality](#orgb1f9349)
        3.  [Performance](#orgbe65a32)
        4.  [DTLS](#orgae6a564)
        5.  [Documentation & Examples](#orgcd67034)
        6.  [Infrastructure](#org2c57ecc)
    2.  [How to Contribute](#org0732266)
11. [License](#org1db5e98)
12. [Credits and Acknowledgments](#org6fd3804)
    1.  [Janet Language](#org8f86430)
    2.  [cqueues](#org9abafd0)
    3.  [janet-jdn](#org44b8619)



<a id="org33d280d"></a>

# Overview

**jsec** (JSEC) is a TLS/SSL library for Janet that aims to be production-quality, built on OpenSSL. It features proper async integration with Janet's event loop (\`ev/\`), a security-first design, and comprehensive support for both client and server modes.


<a id="org7e6e344"></a>

## API Compatibility Guarantee

The primary design goal of \`jsec\` is strict compatibility with Janet's standard Stream API.

-   ****Initialization:**** The only intended difference is in connection initialization (e.g., \`tls/connect\` vs \`net/connect\`).
-   ****Behavior:**** Once established, a TLS stream should behave **identically** to a standard TCP stream for all methods (\`:read\`, \`:write\`, \`:close\`, \`:chunk\`, etc.).
-   ****Extensions:**** Where the standard API uses optional arguments (\`&opt\`), \`jsec\` may offer extensions. These arguments function as an "either/or" mechanism: they strictly support the standard Janet Stream API conventions but may **also** accept library-specific values (e.g., TLS-specific configuration tables) where appropriate.

****Any deviation in behavior from the standard Janet Stream API (unexpected blocking, method signature mismatches, return value differences) when used in a standard context is considered a bug.**** The author has validated this to the best of their ability, but if you encounter any such inconsistency, please report it immediately.


<a id="org8c86742"></a>

# ⚠️ Security and Auditing Disclaimer

This library implements critical cryptographic protocols. Users must understand the risks associated with this type of software:

-   ****NO formal security audit has been performed on this codebase.**** While the library aims to follow strict engineering and testing standards, we recommend users perform their own risk assessment before deploying in high-value or sensitive production environments. Use at your own risk.
-   ****Cryptographic Primitives:**** The security of the library relies heavily on the underlying C libraries (OpenSSL). While these libraries are industry standards, the binding layer and integration logic have not yet undergone external security review.
-   ****Vulnerability Reporting:**** We highly encourage community review. If you discover a vulnerability, please report it immediately via a fossil ticket or GitHub issue as a public issue. We will address valid reports as promptly as possible. Once the library has been audited in the future this section will be updated with information on how to submit privately so that a fix can be made before the issue is made publicly known, but during this phase of development there is no reason such should not be public by default, and we will strive to keep things as public by default even in the future unless there is a true worry that disclosure might lead to abuse.


<a id="orgb5ac10d"></a>

# ✅ Robust Testing & Stability Assurance

While a security audit is pending, the library maintains high standards for functional correctness and stability:

-   ****Comprehensive Test Suite:**** The library currently passes over ****2,000 automated functional tests**** covering handshake procedures, certificate validation, data transfer, error handling, and various edge cases. The high test count is derived from a matrix of test configurations (TLS versions, cipher suites, underlying raw protocol, etc.) run against every functional test case.
-   ****Performance Benchmarking (Experimental):**** A preliminary performance testing framework (perf9) exists for benchmarking throughput, latency, and scalability. **Note: Performance testing is unstable - output formats, metrics, and implementation details are subject to change. Both Janet and C-side optimizations are ongoing.**
    -   Protocol comparison (TCP vs TLS vs Unix sockets)
    -   TLS version performance comparison
    -   Scaling tests across client counts
    -   Concurrency mode testing (fibers, threads, subprocesses)
    -   Handshake timing analysis
-   ****Continuous Integration:**** Tests are run automatically on every commit via GitHub Actions across Linux environments to ensure ongoing stability. (planned)


<a id="orge45f9e2"></a>

## Example Performance Output

Note that perf can be somewhat skewed by testing framework intricacies but it
gives a bit of an idea.

<div class="details" id="orgc7f0da9">
<div class="summary" id="org498b36d">
<p>
Sample perf9 run: 50 clients, 4 servers, 4 client-hosts, threaded mode, 30s duration
</p>

</div>

<pre class="example" id="orgbde57e5">
================================================================================
  Results by Protocol
================================================================================

  tcp:
    Throughput:    338.07 MB/s (mean), 338.07 MB/s (median), 338.07 MB/s (p95)
    Client range:  1.68 MB/s (slowest) → 1.87 MB/s (fastest)
    Total bytes:   9.90 GB
    Iterations:    81136
    Connected:     200/200
    Participants:  4 server(s), 4 client-host(s)
    Tests:         1

  tls:
    Throughput:    196.54 MB/s (mean), 196.54 MB/s (median), 200.93 MB/s (p95)
    Client range:  980.33 KB/s (slowest) → 1.01 MB/s (fastest)
    Handshake:     346.24 ms (mean), 363.73 ms (p95)
    Total bytes:   11.52 GB
    Iterations:    94339
    Connected:     400/400
    Participants:  4 server(s), 4 client-host(s)
    Tests:         2

================================================================================
  Results by TLS Version
================================================================================

  TLS 1.3:
    Throughput:    196.54 MB/s (mean), 196.54 MB/s (median), 200.93 MB/s (p95)
    Client range:  980.33 KB/s (slowest) → 1.01 MB/s (fastest)
    Handshake:     347.64 ms (mean), 366.18 ms (p95)
    Total bytes:   11.52 GB
    Iterations:    94339
    Connected:     400/400
    Participants:  4 server(s), 4 client-host(s)
    Tests:         2

================================================================================
  Overall Statistics
================================================================================

  All tests:
    Throughput:    243.72 MB/s (mean), 200.93 MB/s (median), 338.07 MB/s (p95)
    Client range:  980.33 KB/s (slowest) → 1.87 MB/s (fastest)
    Handshake:     348.33 ms (mean), 366.47 ms (p95)
    Total bytes:   21.42 GB
    Iterations:    175475
    Connected:     600/600
    Participants:  4 server(s), 4 client-host(s)
    Tests:         3
</pre>

<p>
Run command:
</p>

<div class="org-src-container">
<pre class="src src-bash"># TCP test
janet test/runner.janet \
  -f 'performance/perf9/echo[protocol=:tcp,client-count=50,duration=30]&lt;parallel=:thread,server=4,client-host=4&gt;' \
  --json /tmp/perf-tcp.json

# TLS 1.3 test
janet test/runner.janet \
  -f 'performance/perf9/echo[protocol=:tls,client-count=50,duration=30,tls-version=1.3]&lt;parallel=:thread,server=4,client-host=4&gt;' \
  --json /tmp/perf-tls.json

# Analyze results
./bin/perf9-analyze -n /tmp/perf-combined.json
</pre>
</div>

</div>
