README.org
** Testing Status & Maturity

Although the test count is high, effectively approaching fuzzing-level coverage, the library is still in active development. While the current test suite has successfully prevented known bugs, coverage is not yet exhaustive. Users should assume that testing requires further refinement, even though the current state is robust. The test infrastructure includes mechanisms to track expected failures and skips, ensuring that the matrix of scenarios is handled correctly.

* ⭐ Features and Compatibility

The library is designed for flexibility and portability across various systems and underlying TLS implementations.

** Core Features
- **Async-First:** Fully integrated with Janet's `ev` module for non-blocking I/O.
- **Secure Defaults:** Certificate verification enabled by default. Modern TLS 1.2+ only.
- **TLS 1.2 & 1.3:** Full support (dependent on underlying C library version).
- **Client & Server Modes:** Robust support for both ends of the connection.
- **Certificate Handling:** Full support for validation and mTLS (Mutual TLS).
- **OCSP Stapling:** Support included.
- **SNI:** Server Name Indication support.
- **Session Resumption:** Built-in OpenSSL session cache support for performance.
- **Runtime Cert Generation:** Generate self-signed certificates on the fly.

** Supported Backends

The library supports multiple industry-standard TLS/SSL C libraries:

| Backend  | Status  | Notes                                        |
|----------+---------+----------------------------------------------|
| OpenSSL  | Working | Primary backend. OpenSSL 3.0+ required.      |
| LibreSSL | Working | For BSD platforms. Requires LibreSSL 3.9+.   |
| mbedTLS  | Future  | Lighter-weight alternative for embedded use. |

** Operating System Support

| Platform     | Status  | Backend       | Notes                                  |
|--------------+---------+---------------+----------------------------------------|
| Linux        | Working | OpenSSL 3.0+  | Primary development platform           |
| FreeBSD      | Working | OpenSSL 3.x   | Tested on FreeBSD 15                   |
| macOS        | Working | OpenSSL 3.x   | Via Homebrew: ~brew install openssl@3~ |
| NetBSD       | Working | OpenSSL 3.x   | Tested on NetBSD 10.1                  |
| DragonflyBSD | Working | LibreSSL 3.9+ | Tested on DragonflyBSD 6.4             |
| OpenBSD      | Working | LibreSSL 3.9+ | All tests pass on OpenBSD 7.6          |
| Windows      | Planned | OpenSSL       | Community help needed                  |

** Current Limitations
- [ ] **DTLS Support is minimal/experimental.** It is not recommended for production use yet (mostly performance issues).
- [ ] Only X.509 certificates are supported; no FIDO/U2F integration.

* Installation

#+BEGIN_SRC shell
jpm install https://github.com/llmII/jsec.git
#+END_SRC

* Documentation & Examples

- **[[file:docs/API.org][API Reference]]**: Detailed documentation of all modules and functions.
- **[[file:docs/GUIDE.org][Guides]]**: Best practices, Async I/O, mTLS, and more.
- **[[file:examples/][Examples]]**: Complete, runnable code examples.

* Quick Start

** Secure Client (TCP/TLS)

#+BEGIN_SRC janet
(import jsec/tls)

# Connect to a server (certificate verification enabled by default)
(def stream (tls/connect "example.com" "443"))

(defer (:close stream)
  # Send HTTP request
  (:write stream "GET / HTTP/1.1\r\nHost: example.com\r\nConnection: close\r\n\r\n")

  # Read response
  (def buf @"")
  (while (def chunk (:read stream 4096))
    (buffer/push buf chunk))
  
  (print (string buf)))
#+END_SRC

** Secure Server (TCP/TLS)

#+BEGIN_SRC janet
(import jsec/tls)

# Create a listener
(def listener (tls/listen "127.0.0.1" "8443"))

(print "Listening on 127.0.0.1:8443...")

(forever
  (def client (tls/accept listener {
    :cert "server-cert.pem"
    :key "server-key.pem"
  }))
  
  (ev/go (fn []
    (defer (:close client)
      (:write client "Hello, Secure World!\n")))))
#+END_SRC

** Self-Signed Certificate Generation

Useful for testing or internal tools.

#+BEGIN_SRC janet
(import jsec/cert)

(def certs (cert/generate-self-signed-cert {
  :common-name "localhost"
  :days-valid 30
}))

(spit "cert.pem" (certs :cert))
(spit "key.pem" (certs :key))
#+END_SRC

** STARTTLS Upgrade

Upgrade an existing plaintext connection to TLS.

#+BEGIN_SRC janet
(import jsec/tls)

# 1. Connect in plaintext
(def stream (net/connect "smtp.example.com" "25"))

# ... perform plaintext handshake (EHLO, STARTTLS) ...
(:write stream "STARTTLS\r\n")
(:read stream 1024) # Consume server response

# 2. Upgrade to TLS
(print "Upgrading...")
(def tls-stream (tls/upgrade stream "smtp.example.com" {
  :verify true
}))

# 3. Continue securely
(:write tls-stream "AUTH PLAIN ...")
#+END_SRC

** DTLS (Datagram TLS)

*Note: DTLS support is currently experimental.*

#+BEGIN_SRC janet
(import jsec/dtls)

# Client
(def udp-socket (net/connect "127.0.0.1" "4433" :datagram))
(def dtls-client (dtls/client udp-socket {:verify true}))

(dtls/write dtls-client "Hello DTLS")
(print (dtls/read dtls-client 1024))
(dtls/close dtls-client)

# Server
(def listener (net/listen "0.0.0.0" "4433" :datagram))
(def dtls-server (dtls/server listener {
  :cert "cert.pem"
  :key "key.pem"
}))
#+END_SRC

** BIO (Basic I/O Abstraction)

Use OpenSSL BIOs for custom I/O handling, such as memory buffers.

#+BEGIN_SRC janet
(import jsec/bio)

(def mem-bio (bio/new-mem))
(bio/write mem-bio "Secret Data")
(def data (bio/read mem-bio 100))
#+END_SRC

** Crypto Primitives

Access to OpenSSL crypto functions for hashing, signing, and verification.

#+BEGIN_SRC janet
(import jsec/crypto)

# Hashing
(def hash (crypto/digest :sha256 "data"))

# Signing (Ed25519)
(def key (crypto/generate-key :ed25519))
(def sig (crypto/sign key "data"))
(def valid (crypto/verify key "data" sig))
#+END_SRC

* Development & Testing

** Building

Standard build:
#+BEGIN_SRC shell
jpm build
#+END_SRC

Clean build:
#+BEGIN_SRC shell
jpm clean
jpm build
#+END_SRC

** Running Tests

Run tests using the assay test runner directly (jpm test is deprecated):

#+BEGIN_SRC shell
# Run unit, regression, and coverage tests (excludes long-running performance)
janet test/runner.janet -f '{unit,regression,coverage}'

# Run with summary output
janet test/runner.janet -f '{unit,regression,coverage}' --verbosity 1

# Run specific category
janet test/runner.janet -f 'unit'

# Run specific suite pattern
janet test/runner.janet -f 'unit/TLS*'

# List available suites
janet test/runner.janet --list suites
#+END_SRC

See [[file:docs/TESTING.org][docs/TESTING.org]] for complete testing documentation.

** Memory Leak Checking

Run tests under valgrind:
#+BEGIN_SRC shell
janet test/runner.janet --wrapper 'valgrind --leak-check=full'
#+END_SRC

** Debug Build

Enable debug logging in C code:
#+BEGIN_SRC shell
# Edit src/jshared.h and uncomment: #define JSEC_DEBUG 1
jpm build
#+END_SRC

