README.md


<a id="org919a7ee"></a>

## Testing Status & Maturity

Although the test count is high, effectively approaching fuzzing-level coverage, the library is still in active development. While the current test suite has successfully prevented known bugs, coverage is not yet exhaustive. Users should assume that testing requires further refinement, even though the current state is robust. The test infrastructure includes mechanisms to track expected failures and skips, ensuring that the matrix of scenarios is handled correctly.


<a id="orgc6cbbe1"></a>

# ⭐ Features and Compatibility

The library is designed for flexibility and portability across various systems and underlying TLS implementations.


<a id="orgd4194c9"></a>

## Core Features

-   ****Async-First:**** Fully integrated with Janet's \`ev\` module for non-blocking I/O.
-   ****Secure Defaults:**** Certificate verification enabled by default. Modern TLS 1.2+ only.
-   ****TLS 1.2 & 1.3:**** Full support (dependent on underlying C library version).
-   ****Client & Server Modes:**** Robust support for both ends of the connection.
-   ****Certificate Handling:**** Full support for validation and mTLS (Mutual TLS).
-   ****OCSP Stapling:**** Support included.
-   ****SNI:**** Server Name Indication support.
-   ****Session Resumption:**** Built-in OpenSSL session cache support for performance.
-   ****Runtime Cert Generation:**** Generate self-signed certificates on the fly.


<a id="orgc299e2a"></a>

## Supported Backends

The library supports multiple industry-standard TLS/SSL C libraries:

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Backend</th>
<th scope="col" class="org-left">Status</th>
<th scope="col" class="org-left">Notes</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">OpenSSL</td>
<td class="org-left">Working</td>
<td class="org-left">Primary backend. OpenSSL 3.0+ required.</td>
</tr>

<tr>
<td class="org-left">LibreSSL</td>
<td class="org-left">Working</td>
<td class="org-left">For BSD platforms. Requires LibreSSL 3.9+.</td>
</tr>

<tr>
<td class="org-left">mbedTLS</td>
<td class="org-left">Future</td>
<td class="org-left">Lighter-weight alternative for embedded use.</td>
</tr>
</tbody>
</table>


<a id="orgbe2a0fe"></a>

## Operating System Support

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Platform</th>
<th scope="col" class="org-left">Status</th>
<th scope="col" class="org-left">Backend</th>
<th scope="col" class="org-left">Notes</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Linux</td>
<td class="org-left">Working</td>
<td class="org-left">OpenSSL 3.0+</td>
<td class="org-left">Primary development platform</td>
</tr>

<tr>
<td class="org-left">FreeBSD</td>
<td class="org-left">Working</td>
<td class="org-left">OpenSSL 3.x</td>
<td class="org-left">Tested on FreeBSD 15</td>
</tr>

<tr>
<td class="org-left">macOS</td>
<td class="org-left">Working</td>
<td class="org-left">OpenSSL 3.x</td>
<td class="org-left">Via Homebrew: <code>brew install openssl@3</code></td>
</tr>

<tr>
<td class="org-left">NetBSD</td>
<td class="org-left">Working</td>
<td class="org-left">OpenSSL 3.x</td>
<td class="org-left">Tested on NetBSD 10.1</td>
</tr>

<tr>
<td class="org-left">DragonflyBSD</td>
<td class="org-left">Working</td>
<td class="org-left">LibreSSL 3.9+</td>
<td class="org-left">Tested on DragonflyBSD 6.4</td>
</tr>

<tr>
<td class="org-left">OpenBSD</td>
<td class="org-left">Working</td>
<td class="org-left">LibreSSL 3.9+</td>
<td class="org-left">All tests pass on OpenBSD 7.6</td>
</tr>

<tr>
<td class="org-left">Windows</td>
<td class="org-left">Planned</td>
<td class="org-left">OpenSSL</td>
<td class="org-left">Community help needed</td>
</tr>
</tbody>
</table>


<a id="org9768df8"></a>

## Current Limitations

-   [ ] ****DTLS Support is minimal/experimental.**** It is not recommended for production use yet (mostly performance issues).
-   [ ] Only X.509 certificates are supported; no FIDO/U2F integration.


<a id="org84c26b7"></a>

# Installation

    jpm install https://github.com/llmII/jsec.git


<a id="orgb019ee2"></a>

# Documentation & Examples

-   ****[API Reference](docs/API.md)****: Detailed documentation of all modules and functions.
-   ****[Guides](docs/GUIDE.md)****: Best practices, Async I/O, mTLS, and more.
-   ****[Examples](examples/)****: Complete, runnable code examples.


<a id="orgf7f42fc"></a>

# Quick Start


<a id="org6825ddf"></a>

## Secure Client (TCP/TLS)

    (import jsec/tls)
    
    # Connect to a server (certificate verification enabled by default)
    (def stream (tls/connect "example.com" "443"))
    
    (defer (:close stream)
      # Send HTTP request
      (:write stream "GET / HTTP/1.1\r\nHost: example.com\r\nConnection: close\r\n\r\n")
    
      # Read response
      (def buf @"")
      (while (def chunk (:read stream 4096))
        (buffer/push buf chunk))
    
      (print (string buf)))


<a id="orgc974e1e"></a>

## Secure Server (TCP/TLS)

    (import jsec/tls)
    
    # Create a listener
    (def listener (tls/listen "127.0.0.1" "8443"))
    
    (print "Listening on 127.0.0.1:8443...")
    
    (forever
      (def client (tls/accept listener {
        :cert "server-cert.pem"
        :key "server-key.pem"
      }))
    
      (ev/go (fn []
        (defer (:close client)
          (:write client "Hello, Secure World!\n")))))


<a id="org23ce23b"></a>

## Self-Signed Certificate Generation

Useful for testing or internal tools.

    (import jsec/cert)
    
    (def certs (cert/generate-self-signed-cert {
      :common-name "localhost"
      :days-valid 30
    }))
    
    (spit "cert.pem" (certs :cert))
    (spit "key.pem" (certs :key))


<a id="org910d40b"></a>

## STARTTLS Upgrade

Upgrade an existing plaintext connection to TLS.

    (import jsec/tls)
    
    # 1. Connect in plaintext
    (def stream (net/connect "smtp.example.com" "25"))
    
    # ... perform plaintext handshake (EHLO, STARTTLS) ...
    (:write stream "STARTTLS\r\n")
    (:read stream 1024) # Consume server response
    
    # 2. Upgrade to TLS
    (print "Upgrading...")
    (def tls-stream (tls/upgrade stream "smtp.example.com" {
      :verify true
    }))
    
    # 3. Continue securely
    (:write tls-stream "AUTH PLAIN ...")


<a id="orge8c8bea"></a>

## DTLS (Datagram TLS)

**Note: DTLS support is currently experimental.**

    (import jsec/dtls)
    
    # Client
    (def udp-socket (net/connect "127.0.0.1" "4433" :datagram))
    (def dtls-client (dtls/client udp-socket {:verify true}))
    
    (dtls/write dtls-client "Hello DTLS")
    (print (dtls/read dtls-client 1024))
    (dtls/close dtls-client)
    
    # Server
    (def listener (net/listen "0.0.0.0" "4433" :datagram))
    (def dtls-server (dtls/server listener {
      :cert "cert.pem"
      :key "key.pem"
    }))


<a id="orgfb16196"></a>

## BIO (Basic I/O Abstraction)

Use OpenSSL BIOs for custom I/O handling, such as memory buffers.

    (import jsec/bio)
    
    (def mem-bio (bio/new-mem))
    (bio/write mem-bio "Secret Data")
    (def data (bio/read mem-bio 100))


<a id="orga209e87"></a>

## Crypto Primitives

Access to OpenSSL crypto functions for hashing, signing, and verification.

    (import jsec/crypto)
    
    # Hashing
    (def hash (crypto/digest :sha256 "data"))
    
    # Signing (Ed25519)
    (def key (crypto/generate-key :ed25519))
    (def sig (crypto/sign key "data"))
    (def valid (crypto/verify key "data" sig))


<a id="org5fd78c7"></a>

# Development & Testing


<a id="org5d9befa"></a>

## Building

Standard build:

    jpm build

Clean build:

    jpm clean
    jpm build


<a id="orgf280252"></a>

## Running Tests

Run tests using the assay test runner directly (jpm test is deprecated):

    # Run unit, regression, and coverage tests (excludes long-running performance)
    janet test/runner.janet -f '{unit,regression,coverage}'
    
    # Run with summary output
    janet test/runner.janet -f '{unit,regression,coverage}' --verbosity 1
    
    # Run specific category
    janet test/runner.janet -f 'unit'
    
    # Run specific suite pattern
    janet test/runner.janet -f 'unit/TLS*'
    
    # List available suites
    janet test/runner.janet --list suites

See [docs/TESTING.org](docs/TESTING.md) for complete testing documentation.


<a id="org2a3a736"></a>

## Memory Leak Checking

Run tests under valgrind:

    janet test/runner.janet --wrapper 'valgrind --leak-check=full'


<a id="orga75b7f7"></a>

## Debug Build

Enable debug logging in C code:

    # Edit src/jshared.h and uncomment: #define JSEC_DEBUG 1
    jpm build
