README.org
** Code Formatting

Format Janet code:
#+BEGIN_SRC shell
jpm run format-janet
#+END_SRC

Format C code:
#+BEGIN_SRC shell
jpm run format-c
#+END_SRC

** Documentation Generation

Generate markdown from org files:
#+BEGIN_SRC shell
jpm run docs
#+END_SRC

** Release Process

Prepare a release:
#+BEGIN_SRC shell
jpm run release
#+END_SRC

This runs: clean, format checks, build, tests, leak checks, and documentation
generation.

** Test Coverage Details

The test suite is extensive, with over 2,000 generated test cases covering:
- TLS Suite: Client/server, STARTTLS, SNI, session resumption, OCSP, concurrency (Main Matrix)
- DTLS Suite: UDP/DTLS client/server operations
- Cert Suite: Certificate generation and validation
- BIO Suite: Memory BIO operations
- Crypto Suite: Hashing, signing, verification

* Security Configuration

You can pass a `:security` table to `connect` or `accept` to enforce policies:

#+BEGIN_SRC janet
:security {
  :min-version "TLS1.2"
  :max-version "TLS1.3"
  :ciphers "ECDHE-ECDSA-AES128-GCM-SHA256:ECDHE-RSA-AES128-GCM-SHA256"
  :curves "X25519:P-256"
  :session-cache-size 1000
}
#+END_SRC

* Contributing

We welcome contributions! JSEC is an ambitious project and there are many areas where community help would be valuable.

** Areas Seeking Help

*** Platform Support
- *Windows:* Testing, debugging, and CI improvements for Windows builds
- *Cross-platform testing:* Help test on additional BSD variants or Linux distributions

*** Testing & Quality
- *Test Suite Expansion:* Additional edge cases, protocol scenarios, error conditions
- *Sanitizer Integration:* Improving ASan/UBSan/LSan coverage and CI integration
- *Fuzzing:* Setting up continuous fuzzing infrastructure
- *Code Review:* Security-focused review of the C binding layer

**** Quick Wins for New Contributors
Looking for an easy way to get started? These focused improvements help build familiarity with the codebase:

- *Convert server/client tests to assay coordinated tests:* Many TLS/DTLS tests manually spawn server and client fibers with ~ev/sleep~ delays to coordinate timing. These patterns are ideal candidates for conversion to assay's ~coordinated~ test type, which provides built-in participant synchronization via barriers and channels. While ~coordinated~ was designed for performance testing, it works well for any multi-participant scenario requiring coordination. See ~suites/performance/~ for examples.
- *Expand matrix test coverage:* assay's ~matrix~ feature generates test combinations automatically. Originally designed for fuzz testing parameter spaces, matrices are useful anywhere you need to test across multiple configurations (TLS versions, cipher suites, buffer sizes, etc.). Look for tests with manual loops over configurations that could be converted to declarative matrices.

*** Performance
- *C-side Optimizations:* Buffer handling, memory allocation patterns
- *Janet-side Optimizations:* API layer efficiency improvements
- *Benchmarking:* Expanding the perf9 test matrix and analysis tools
- *Profiling:* Identifying bottlenecks under various workloads

*** DTLS
- *Protocol Correctness:* DTLS has known issues and needs attention
- *Multi-client Server:* Improving the DTLS server implementation
- *Testing:* Expanding DTLS test coverage

*** Documentation & Examples
- *Tutorials:* Real-world usage guides (mTLS setup, OCSP, etc.)
- *Examples:* More complete example applications
- *API Documentation:* Improving clarity and completeness

*** Infrastructure
- *CI/CD:* GitHub Actions improvements, cross-platform testing
- *Packaging:* Distribution packages, container images
- *Testing Framework:* Improvements to the [[https://github.com/llmII/janet-assay][assay]] test framework

** How to Contribute

1. Check existing issues on GitHub or Fossil
2. For large changes, open an issue first to discuss approach
3. Follow the coding style (see ~jpm run format-janet~ and ~jpm run format-c~)
4. Ensure tests pass: ~janet test/runner.janet -f '{unit,regression,coverage}'~
5. Submit a PR on GitHub or patch via Fossil

* License

ISC License. See LICENSE file.

* Credits and Acknowledgments

This project was made possible by studying and learning from:

** Janet Language
- Authors: Calvin Rose and contributors
- License: MIT
- Website: https://janet-lang.org/
- Some test patterns in this library were adapted from Janet's test suite (MIT licensed).

** cqueues
- Author: William Ahern
- License: MIT
- Repository: https://github.com/wahern/cqueues
- The event loop integration patterns, particularly for TLS BIO handling, were informed by studying cqueues' excellent implementation.

** janet-jdn
- Author: Andrew Chambers
- License: MIT
- Repository: https://github.com/andrewchambers/janet-jdn
- The JDN encode/decode pattern in our performance testing framework is based on his work.

If you are an author or contributor to any project that influenced this work and would like explicit acknowledgment, please file a GitHub issue or fossil ticket.
